Revit 2027 API
RebarConstrainedHandle.GetPossibleHandleBehaviors Method
 Gets a list of possible handle behaviors for the current handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarHandleBehavior> GetPossibleHandleBehaviors()
Public Function GetPossibleHandleBehaviors As IList(Of RebarHandleBehavior)
public:
IList<RebarHandleBehavior>^ GetPossibleHandleBehaviors()
member GetPossibleHandleBehaviors : unit -> IList<RebarHandleBehavior>
Return Value
IList<RebarHandleBehavior>
 Returns a list of possible handle behaviors for the current handle.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace